{"class_name": "Sequential", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 8, 8, 2048], "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_189", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "padding": "same", "dtype": "float32", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_190", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "padding": "same", "dtype": "float32", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "data_format": "channels_last", "strides": [3, 3], "padding": "valid", "trainable": true, "name": "max_pooling2d_9", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "noise_shape": null, "name": "dropout_1", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "filters": 64, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_191", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "padding": "same", "dtype": "float32", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "filters": 64, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_192", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "padding": "same", "dtype": "float32", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_10", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "noise_shape": null, "name": "dropout_2", "trainable": true, "dtype": "float32"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "units": 512}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.6, "noise_shape": null, "name": "dropout_3", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "units": 256}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "noise_shape": null, "name": "dropout_4", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true, "kernel_constraint": null, "units": 1}}], "name": "sequential_1"}, "backend": "tensorflow"}